<!DOCTYPE HTML>
<html>
    <head>
        <title>The Jargon Files</title>
        <style type ="text/css">
            body{background-color: #ffcce6}
            h2{text-align: center}
            h3{background: #ff99ce}
            h4{background: #ff4da9; font: color=#ffffff}
            pre{background: #ffffff}
        </style>
    </head>
    <body>
        <h2><b><u> THE JARGON FILE</u></b></h2>
        <h3><b> AFAIK </b></h3>
            <p>Abreviatura de As Far As I Know &#91; "por lo que yo s&eacute; &#93;.AFAIK sugiere que el autor sabe que su conocimiento es limitado. Existe la variante AFAICT &#91;As Far As I Can Tell, "Por lo que yo puedo decir"&#93; que sugiere que el autor cree tener conocimientos suficientes sobre el tema, pero que no se pueden emitir opciones concluyentes. </p>
        <h3><b>BSOD</b></h3>
        <p>Abreviatura de Blue Screen of Death &#91;"pantalla azul de la muerte"&#93;. Proviene de una expresi&oacute; anterior &#91;"pantalla negra de la muerte"&#93; , pero mucho m&aacute;s popular. Se refiere a la pantalla azul que muestra Windows cuando deja de funcionar, por culpa de una aplicaci&oacute;n o del propio sistema operativo. En esa pantalla suelen aparecer c&oacute;digos hexadecimales, con fines seguramente decorativos. Como prueba de la popularidad del t&eacute;rmino, sirva del siguiente poema del concurso de Haikus Salon&#58;           
            <dd><br>Windowa NT se ha colgado</dd>
            <dd><br>Soy la pantalla azul de la muerte</dd>
            <dd><br>Nadie oir&aacute; tus gritos</dd>
            </p>
        <h3><b>FAQ</b></h3>
            <p>Abreviatura de Frequently Asked Question &#91;"pregunta planteada a menudo" &#93;. Se refiere a las preguntas que se plantean una y otra vez en listas de correo, foros, etc. pero tami&eacute;n se refiere a los documentos que recopilan ese tipo de preguntas. Hace años, este tipo de documentos se enviaban peri&oacute;dicamente en los grupos de noticias &#40;newsgroups&#41; para evitar la repetici&oacute;n innecesaria de las mismas preguntas. Posteriormente, este tipo de documentos &#40;organizados mediante preguntas y respuestas&#41; se incorporaron tambi&eacute; a los sitios web para ofrecer informaci&oacute;n a los visitantes.</p>
        <h3><b>FUD</b></h3>
            <p>Abreviatura de Fear, Uncertainty and Doubt &#91;"miedo, incertidumbre y duda"&#93;. Expresi&oacute;n creada por Gene Amdhal tras abandonar IBM para fundar su propia empresa&#58; "FUD es el miedo, la incertidumbre y la duda que los vendedores de IBM inculcan en la mente de los clientes que est&eacute;n considerando la compra de productos de otras empresas". Los productos de IBM ser&iacute;n seguros y fiables, mientras que los de otras empresas supondr&iacute;n una compra muy arriesgada. En los años 90, este t&eacute;rmino se asoci&oacute; a menudo con Microsoft y, en general, con las t&eacute;cnicas de propaganda comercial basadas en la desinformaci&oacute;n.</p>
        <h3><b>GIYF</b></h3>
            <p>Abrebiatura de Google Is Your Friend &#91;"Google es tu amigo"&#93;. Se emplea para sugerir a quien ha planteao una pregunta que la respuesta puede encontrarse usando un buscador, en vez de pedir ayuda a un humano.</p>
        <h3><b>IANAL</b></h3>
            <p>Abreviatura de I Am Not A Lawyer &#91;"no soy abogado"&#93;. Se utiliza antes de dar un consejo legal, para evitar responsibilidades.</p>
        <h3><b>IMHO</b></h3>
            <p>Abreviatura de In My Humble Opinion &#91;"en mi humilde opini&oacute;n" &#93;. Se utiliza antes de dar una opini&oacute;n. Existen variantes como IMNSHO &#91;In My Not&#45;So&#45;Humble Opinion, "en mi no tan humilde opini&oacute;n"&#93; o IMAO &#91;In My Arrogant Opinion, "en mi arrogante opini&oacute;n"&#93;</p>
        <h3><b>Estilos de sangrado</b></h3>
            <p>Reglas para hacer el c&oacute;digo m&aacute;s legibl, mediante su sangrado, espaciado y colocaci&oacute;n de las llaves &#40;&#123;&#125;&#41;. Los cuatro estilos de sangrado m&aacute; antiguos del lenguaje de programaci&oacute;n C, heredados en otros lenguajes, son&#58;</p>
        <h4>Estilo K&amp;R</h4>
            <p>Es el estilo utilizado en el libro sobre programaci&oacute;n en C escrito por Kernighan y Ritchie y utilizado tambi&eacute;n en el kernel de Linux &#40;obra de Ritchie y Thompson&#41;</p>
            <pre>
    if &#40;&lt;cond&gt;&#41;
    &#123;
            &lt;body&gt;
    &#125;
            </pre>
        <h4>Estillo Allman</h4>
            <p>Es el estilo utilizado por Eric Allman, creador de muchas utilidades BSD.</p>
    <pre>
    if&#40;&lt;cond&gt;&#41;
    &#123;
        &lt;body&gt;
    &#125;
    </pre>
        <h4> Estilo Whitesmiths</h4>
            <p>ES el estilo utilizado en los ejemplos de uno de los primeros compiladores comerciales de C. Whitesmiths C.</p>
    <pre>
    if &#40;&lt;cond&gt;&#41;
            &#123;
            &lt;body&gt;
            &#125;
    </pre>
        <h4> Estilo GNU</h4>
            <p>Es el estilo utilizado en el editor EMACS y en el c&oacute;digo creado por la Free Software Foundation.</p>
    <pre>
    if&#40;&lt;cond&gt;&#41;
        &#123;
            &lt;body&gt;
        &#125;
    </pre>
        <h3>RTFM</h3>
            <p>Abreviatura de Read The Fucking Manual &#91;"lea el p&#42;&#42;&#42; manual" &#93;. Usado por expertos para expresar con rudeza que no deben ser molestados con preguntas triviales. Usado tambi&eacute;n por novatos para indicar que han intentado encontrar la respuesta por si mismos antes de preguntar a otros. 
            </p>
    </body>
</html>